---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.IsValidObject
source: html/5bb6d514-66ec-24a5-8560-7bdd92a6b766.htm
---
# Autodesk.Revit.DB.CameraInfo.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.